Documents/ЗаявкаНаРоуминг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаявкаНаРоуминг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыгруженаЗаявкаОператоруСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяSIMКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРоуминг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоездки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоездок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗаявкиНаРоумингЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаявкиНаРоумингЛимиты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПолучательРассылок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтправительПисьмаОператоруСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиДляРассылки</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаТелефонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваПользователейНаРедактированиеГрафиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПраваПользователейНаРедактированиеГрафиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПоездок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыПоездок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отпуск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокНаРоуминг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРоуминг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаРоуминг/Forms/ЗаявкаНаРоуминг/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+++АК sils 08.06.2018 ИП-00018876
	ОперацияАпдекс = APDEX_ОценкаПроизводительностиКлиентСервер.ПолучитьОперацию("Открытие документа Заявка на роуминг");
	APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(ОперацияАпдекс);
	//---АК
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация 				= Справочники.Организации.НайтиПоКоду("000000006"); //Вкусвилл
		Объект.Сотрудник   				= ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
		//+++ AK suvv 15.05.2018 ИП-00018442
		//Объект.РуководительСотрудника 	= Объект.Сотрудник.Руководитель;
		//--- AK suvv
		Объект.ТипПоездки 				= Перечисления.ТипыПоездок.Командировка;
		
		
		ТЗЛимит = РегистрыСведений.ЗаявкиНаРоумингЛимиты.СрезПоследних(,);
		Лимит				= "";
		
		//Перебирает срез регистра от свежих к старым, пока не найдет лимит
		Если ТЗЛимит.Количество() > 0 Тогда
			ТЗЛимит.Сортировать("Период Убыв", Новый СравнениеЗначений);	
			
			Для каждого СтрокаТЗРегистра Из ТЗЛимит Цикл
				Если ЗначениеЗаполнено(Лимит)Тогда
					Прервать;	
				КонецЕсли;	
				
				Если НЕ ЗначениеЗаполнено(Лимит) И ЗначениеЗаполнено(СтрокаТЗРегистра.Лимит) Тогда
					Лимит = СтрокаТЗРегистра.Лимит;
				КонецЕсли;					
			КонецЦикла;
			
		КонецЕсли;	
		
		Объект.ЛимитЗаявки = Лимит;
		
	КонецЕсли;	
	
	//ДопПраваПроверить();  //+++АК LAGP 2018.06.01 ИП-00018863 Отключена система акцепта.
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаАкцепт(Команда)
	
	//+++АК LAGP 2018.06.01 ИП-00018863 Отключена система акцепта.
	//Если Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.ПустаяСсылка() ИЛИ Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.НаРассмотрении Тогда
	//	Ответ = Вопрос("Отправить письмо на согласование?", РежимДиалогаВопрос.ДаНет,,,"Почтовый модуль");
	//	
	//	Если Ответ = КодВозвратаДиалога.Да Тогда		
	//		АкцептоватьЗаявкуОтправкаПочты();
	//	КонецЕсли;
	//КонецЕсли;	
	//---АК LAGP
	
КонецПроцедуры

&НаСервере
Процедура АкцептоватьЗаявкуОтправкаПочты() 
		
	СписокКому = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =                                                                                   
	"ВЫБРАТЬ                                                   
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = Значение(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)";
	Запрос.УстановитьПараметр("Объект", Объект.РуководительСотрудника);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	Иначе
		Сообщить("Не заполнен адрес электронной почты у утверждающего!!");
		Возврат;
	КонецЕсли;
	
	АдресПолучателя = ВыборкаДетальныеЗаписи.Представление;
	
	Акцептант									= Объект.РуководительСотрудника;
	СписокКому 									= Новый СписокЗначений;
	
	Если АдресПолучателя="" Тогда
		СообщениеПоОшибке = НСтр("ru = 'Письмо не отправлено! Не заполнен адрес электронной почты %Выборка_Акцептант%'");
		Сообщить(СтрЗаменить(СообщениеПоОшибке, "%Выборка_Акцептант%", Акцептант));
		//Продолжить;
	КонецЕсли;	
	
	УчетнаяЗапись = ОбщиеПроцедуры.ПолучитьУчетнуюЗаписьДляРассылки(); 
	
	ТекстЗапроса_ЗаявкаНаРоуминг = "ВЫБРАТЬ
	|	ДокументНаАкцепт.Ссылка,
	|	ДокументНаАкцепт.Номер,
	|	ДокументНаАкцепт.Дата,
	|	ДокументНаАкцепт.Организация,
	|	ДокументНаАкцепт.Сотрудник,
	|	ДокументНаАкцепт.СлужебнаяSIMКарта,
	|	ДокументНаАкцепт.РуководительСотрудника,
	|	ДокументНаАкцепт.НачалоДействия,
	|	ДокументНаАкцепт.КонецДействия,
	|	ДокументНаАкцепт.ТипПоездки,
	|	ДокументНаАкцепт.Страна,
	|	ДокументНаАкцепт.Статус
	|ИЗ
	|	Документ.ЗаявкаНаРоуминг КАК ДокументНаАкцепт
	|ГДЕ
	|	ДокументНаАкцепт.Ссылка = &Ссылка";
	
	
	Запрос_ЗаявкаНаРоуминг = Новый Запрос(ТекстЗапроса_ЗаявкаНаРоуминг);	
	Запрос_ЗаявкаНаРоуминг.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Таблица 									= ""; 
	style 										= "<td style = ""background: #fff; text-align: left;""><font FACE=""Verdana"" color=""000000"" size=2";
	ЦветШапки 									= "E5D4F2";
	ЦветШапки 									= "F0FFFF";
	TR 											= "<th style = ""background: #";
	TA											= "; text-align: left;""><font FACE=""Verdana"" color=""000000"" size=2";
	TA1											= "; text-align: left;""><font FACE=""Verdana"" color=""000000"" size=2";
	Инд 										= 1;
	НомерЗаявки 								= "";
	
	Выборка_Документ = Запрос_ЗаявкаНаРоуминг.Выполнить().Выбрать();
	
	Выборка_Документ.Следующий();			
	
	СтрокаПериодПоездки = "" + Формат(Выборка_Документ.НачалоДействия, "ДФ=dd.MM.yyyy") + " - " + Формат(Выборка_Документ.КонецДействия, "ДФ=dd.MM.yyyy");
	
	Таблица = Таблица + "<BR>" + "Дата: <b>" 					+ Выборка_Документ.Дата + "</b>";
	Таблица = Таблица + "<BR>" + "НомерЗаявки: <b>" 			+ Выборка_Документ.Номер + "</b>";
	Таблица = Таблица + "<BR>" + "Организация: <b>" 			+ Выборка_Документ.Организация + "</b>";
	Таблица = Таблица + "<BR>" + "Сотрудник: <b>" 				+ Выборка_Документ.Сотрудник.Наименование + "</b>";
	Таблица = Таблица + "<BR>" + "НомерТелефона: <b>" 			+ Выборка_Документ.СлужебнаяSIMКарта + "</b>";
	Таблица = Таблица + "<BR>" + "ОператорСвязи: <b>" 			+ Выборка_Документ.СлужебнаяSIMКарта.ОператорСвязи + "</b>";
	Таблица = Таблица + "<BR>" + "Руководитель: <b>" 			+ Выборка_Документ.РуководительСотрудника.ПолноеФИО + "</b>";
	Таблица = Таблица + "<BR>" + "ТипПоездки: <b>" 				+ Выборка_Документ.ТипПоездки + "</b>";
	Таблица = Таблица + "<BR>" + "ПериодПоездки: <b>" 			+ СтрокаПериодПоездки + "</b>";
	Таблица = Таблица + "<BR>" + "КоличествоДнейПоездки: <b>" 	+ ((Выборка_Документ.КонецДействия - Выборка_Документ.НачалоДействия) / 86400) + "</b>";
	Таблица = Таблица + "<BR>" + "Страна: <b>" 					+ Выборка_Документ.Страна + "</b>";			
	Таблица = Таблица + "<BR>";
	Таблица = Таблица + "<BR>";	
	Таблица = Таблица + "Выберите пожалуйста вариант ответа:";
	Таблица = Таблица + "<Table border style = ""border-collapse: collapse;""><TR>";				
	Таблица = Таблица + "</Table>";
	Таблица = Таблица + "<br>";
	
	Тема 			= "Заявка на роуминг №" + СокрЛП(Выборка_Документ.Номер) + " от " + Формат(Выборка_Документ.Дата,"ДФ=dd.MM.yyyy");
	ID_MESSAGE 		= Новый УникальныйИдентификатор;
	TYPE_MESSAGE    = 0;
	GUID_Заявки		= Строка(Объект.Ссылка.УникальныйИдентификатор());
	Объект_Ссылка	= Объект.Ссылка;
	УправлениеЭлектроннойПочтой.ОтправитьЗаявкуНаПодтверждение(Тема, Таблица, Выборка_Документ.Номер, СписокКому, GUID_Заявки, ID_MESSAGE, TYPE_MESSAGE, АдресПолучателя, Акцептант, УчетнаяЗапись, Объект_Ссылка);
	
	ОбъектДокумента = Объект.Ссылка.ПолучитьОбъект();
	ОбъектДокумента.Статус = Перечисления.СтатусыЗаявокНаРоуминг.НаРассмотрении;
	ОбъектДокумента.Записать();
	
КонецПроцедуры		

&НаСервере
Процедура ОтправитьПисьмоСервер()
	
	АкцептоватьЗаявкуОтправкаПочты();
	
КонецПроцедуры

&НаСервере
Процедура ДопПраваПроверить()
	
	МассивПраваУпрЗаявкамиНаРоуминг	 = УправлениеДопПравамиПользователей.ПрочитатьЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.УправлениеЗаявкамиНаРоуминг,Ложь,ПараметрыСеанса.ТекущийПользователь);	
	ПравоУправлениеЗаявкамиНаРоуминг = МассивПраваУпрЗаявкамиНаРоуминг[0];
	
	Если НЕ (ПравоУправлениеЗаявкамиНаРоуминг ИЛИ РольДоступна("ПолныеПрава") ИЛИ ПараметрыСеанса.ТекущийПользователь.ФизЛицо = Объект.РуководительСотрудника) Тогда
		
		Элементы.Статус.Доступность = Ложь;
		Элементы.ФормаРедактироватьДопПолучателейРассылок.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура РедактироватьДопПолучателейРассылок(Команда)
	
	ФормаРегистра = РегистрыСведений.ЗаявкиНаРоумингЛимиты.ПолучитьФормуСписка();
	ФормаРегистра.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	//+++АК LAGP 2018.06.01 ИП-00018863 Отключена система акцепта.
	//Если НЕ Объект.Ссылка.Пустая() Тогда
	//	Ответ = Вопрос("Отправить уведомление о смене статуса сотруднику?", РежимДиалогаВопрос.ДаНет,,,"Почтовый модуль");
	//	
	//	Если Ответ = КодВозвратаДиалога.Да Тогда	
	//		
	//		ДокументСсылка = Объект.Ссылка;
	//		
	//		СтруктураПараметров = Новый Структура;
	//		СтруктураПараметров.Вставить("Согласовано", 	Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.Подтвержден);
	//		СтруктураПараметров.Вставить("Отклонено", 		Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.Отклонен);
	//		СтруктураПараметров.Вставить("РучноеИзменение", Истина);
	//		
	//		Документы.ЗаявкаНаРоуминг.ОбработатьСогласованиеДокументаИзПисьма(ДокументСсылка, СтруктураПараметров);
	//		
	//		ЭтаФорма.Прочитать();
	//		
	//	КонецЕсли;
	//Иначе
	//	Сообщить("Для отправки сотруднику письма о смене статуса, документ необходимо записать.");		
	//КонецЕсли;
	//---АК LAGP
	
КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяSIMКартаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаТелефоновСрезПоследних.Номер
	|ИЗ
	|	РегистрСведений.ПривязкаТелефонов.СрезПоследних(, Привязка = &Привязка) КАК ПривязкаТелефоновСрезПоследних";
	
	Запрос.УстановитьПараметр("Привязка", Объект.Сотрудник);		
	ВыборкаСИМКарт = Запрос.Выполнить().Выбрать();
	
	СписокСИМКарт = Новый СписокЗначений;
	СписокСИМКарт.ТипЗначения = Новый ОписаниеТипов("Строка");
	
	Пока ВыборкаСИМКарт.Следующий() Цикл
		СписокСИМКарт.Добавить(Строка(ВыборкаСИМКарт.Номер));	
	КонецЦикла;	
	
	Форма = ПолучитьФорму("Справочник.СлужебныеSIMКарты.ФормаВыбора",,);
	
	Форма.СправочникСписок.Отбор.Код.ВидСравнения = ВидСравнения.ВСписке;
	Форма.СправочникСписок.Отбор.Код.Значение = СписокСИМКарт;
	Форма.СправочникСписок.Отбор.Код.Использование = Истина;
	Форма.ВладелецФормы = ЭтаФорма.Элементы.СлужебнаяSIMКарта;
	Форма.Открыть();
	
КонецПроцедуры

//+++ AK suvv 17.04.2018 ИП-00018442
&НаСервере
Функция ПолучитьСписокРуководителей()
	
	СписокРуководителей = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПраваПользователейНаРедактированиеГрафиков.Пользователь.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрСведений.ПраваПользователейНаРедактированиеГрафиков КАК ПраваПользователейНаРедактированиеГрафиков
	|ГДЕ
	|	(НЕ ПраваПользователейНаРедактированиеГрафиков.Пользователь.ФизЛицо.РоумингТолькоСвоиЗаявки
	|			ИЛИ ПраваПользователейНаРедактированиеГрафиков.Пользователь.ФизЛицо.РоумингТолькоСвоиЗаявки
	|				И ПраваПользователейНаРедактированиеГрафиков.Пользователь = &ТекущийПользователь)";
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокРуководителей.Добавить(Выборка.ФизЛицо);
	КонецЦикла;
	
	Возврат СписокРуководителей;
	
КонецФункции //--- AK suvv 

&НаКлиенте
Процедура РуководительСотрудникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//+++ AK suvv 17.04.2018 ИП-00018442
	//МассивРуководителей = РегистрыСведений.ПраваПользователейНаРедактированиеГрафиков.СоздатьНаборЗаписей();
	//МассивРуководителей.Прочитать();
	//
	//СписокРуководителей = Новый СписокЗначений;
	//СписокРуководителей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	//Для каждого СтрокаМассиваРуководителей Из МассивРуководителей Цикл
	//	СписокРуководителей.Добавить(СтрокаМассиваРуководителей.Пользователь.ФизЛицо);	
	//КонецЦикла;
	СписокРуководителей = ПолучитьСписокРуководителей();
	//--- AK suvv
	
	Форма = ПолучитьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,);
	
	Для каждого Колонка из Форма.ЭлементыФормы.СправочникСписок.Колонки Цикл
		Колонка.Видимость = Ложь;	
	КонецЦикла;	
	Форма.ЭлементыФормы.СправочникСписок.Колонки.Наименование.Видимость = Истина;
	
	Форма.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	Форма.СправочникСписок.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
	Форма.СправочникСписок.Отбор.Ссылка.Значение = СписокРуководителей;
	Форма.СправочникСписок.Отбор.Ссылка.Использование = Истина;
	Форма.ВладелецФормы = ЭтаФорма.Элементы.РуководительСотрудника;
	Форма.Открыть(); 
	
КонецПроцедуры


&НаКлиенте
Процедура РуководительСотрудникаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = ПолучитьРуководителяПоЧастиТекста(Текст);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРуководителяПоЧастиТекста(Текст)
	
    Возврат ПолучитьДанныеВыбора(Тип("СправочникСсылка.ФизическиеЛица"),Новый Структура("ВариантПодбора, ТекстПоиска", "ПодборРуководителей", Текст));
	
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//+++АК LAGP 2018.06.01 ИП-00018863 Отключена система акцепта.
	//Если Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.ПустаяСсылка() Тогда
	//	Ответ = Вопрос("Отправить письмо на согласование?", РежимДиалогаВопрос.ДаНет,,,"Почтовый модуль");
	//	
	//	Если Ответ = КодВозвратаДиалога.Да Тогда			
	//		АкцептоватьЗаявкуОтправкаПочты();
	//	КонецЕсли;
	//КонецЕсли;
	//---АК LAGP
	
	//+++АК LAGP 2018.06.05 ИП-00018863 Уведомление пользователя о возможности отправки письма моб. оператору
	Если НЕ Объект.ВыгруженаЗаявкаОператоруСвязи Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, Неопределено);
		ПоказатьВопрос(Оповещение, "Чтобы открыть лимит на роуминг, необходимо отправить письмо оператору связи (кнопка на панели).", РежимДиалогаВопрос.ОК, 10);	
	КонецЕсли;
	//---АК LAGP
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьОператоруСвязи(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
		Сообщить("Для отправки заявки оператору, документ необходимо провести!");
	Иначе	
		Если Объект.Статус = Перечисления.СтатусыЗаявокНаРоуминг.Подтвержден Тогда
			ОтправитьОператоруСвязиНаСервере();
		Иначе
			Сообщить("Для отправки заявки оператору, статус заявки должен быть ""Подтвержден""!");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

//+++АК LAGP 2018.06.01 ИП-00018863
&НаСервере
Процедура ОтправитьОператоруСвязиНаСервере()
	
	ОбработкаРассылки = Обработки.РассылкаОператорамСвязиПоЗаявкамНаРоуминг.Создать();
	ОбработкаРассылки.ВыполнитьРассылку();
	
КонецПроцедуры

//+++АК LAGP 2018.06.05 ИП-00018863 Уведомление пользователя о возможности отправки письма моб. оператору     
&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
	КонецЕсли;	
	
КонецПроцедуры

//+++АК sils 08.06.2018 ИП-00018876
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени(ОперацияАпдекс, ?(Параметры.Ключ.Пустая(), "Новый документ", "" + Объект.Ссылка));
КонецПроцедуры
